In [1]:
# Import dependencies
import pandas as pd
from matplotlib import pyplot

In [2]:
# Read file
xls=pd.ExcelFile("../resource/data.xlsx")
df1 = pd.read_excel(xls, 'Price')
df2 = pd.read_excel(xls, 'Location')

In [3]:
# Change the column name
df1_=df1.rename(columns={'LOCATION_ID':'ID'})

In [4]:
# left Join df1_ and df2
df_new=pd.merge(df1_,df2,on='ID',how='left')
print(df_new.shape)

# Represent the first five rows of new table
df_new.head()

(3927, 6)

,ID,YEAR,INTERNET_PRICE,CITY,REGION,COUNTRY
0,36333877,2020,109.553333,Anchorage,Alaska,United States
1,97066708,2020,109.223301,Male,Kaafu Atoll,Maldives
2,86180405,2020,104.833333,Harare,NaN,Zimbabwe
3,93339430,2020,101.023925,Abu Dhabi,Emirate of Abu Dhabi,United Arab Emirates
4,26718520,2020,99.333333,Santa Rosa,California,United States

In [5]:
# Summary Statistic for INTERNET_Price column
df_new.describe().INTERNET_PRICE

count    3927.000000
mean       39.996615
std        27.179158
min         1.866995
25%        23.121728
50%        37.403907
75%        54.163430
max       962.189981
Name: INTERNET_PRICE, dtype: float64

In [6]:
# Information about DataFrame
df_new.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 3927 entries, 0 to 3926
Data columns (total 6 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   ID              3927 non-null   int64
 1   YEAR            3927 non-null   int64
 2   INTERNET_PRICE  3927 non-null   float64
 3   CITY            3927 non-null   object
 4   REGION          3270 non-null   object
 5   COUNTRY         3927 non-null   object
dtypes: float64(1), int64(2), object(3)
memory usage: 214.8+ KB

In [7]:
# Determine if we have duplication in the dataset
df_new.duplicated().sum()

0

In [ ]:
# Find outliers 
Q1 = df_new.INTERNET_PRICE.quantile(0.25)
Q3 = df_new.INTERNET_PRICE.quantile(0.75)
IQR = Q3 - Q1
lowerbound = Q1-(1.5 * IQR)
upperbound = Q3 + (1.5 * IQR)
df_outlier=df_new[(df_new.INTERNET_PRICE < lowerbound) | (df_new.INTERNET_PRICE > upperbound)]
df_outlier.shape

In [ ]:
# Eliminate outliers
df_new.drop(df_new[(df_new.INTERNET_PRICE > upperbound)|(df_new.INTERNET_PRICE<lowerbound) ].index , inplace=True)
df_new.shape